app/controllers/songs_controller.rb

  def upload
    CSV.foreach(params[:songs], headers: true) do |song|
      Song.create(title: song[0], artist_id: Artist.find_by(name: song[1]))
---
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2018-07-19 02:07:20.710874"], ["updated_at", "2018-07-19 02:07:20.710874"]]
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 137], ["created_at", "2018-07-19 02:07:20.719477"], ["updated_at", "2018-07-19 02:07:20.719477"]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ? LIMIT 1  [["name", ".38 Special"]]